БСП_ВА/src/InformationRegisters/СвойстваЗаданий/СвойстваЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваЗаданий</name>
  <resources>
    <name>Задание</name>
    <type>
      <types>CatalogRef.ОчередьЗаданий</types>
      <types>CatalogRef.ОчередьЗаданийОбластейДанных</types>
    </type>
  </resources>
  <resources>
    <name>КодСостояния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторСообщенияОбОшибке</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторРезультата</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БСП_ВА/src/InformationRegisters/СвойстваЗаданий/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы
    
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ЗаполнитьДанныеФормы();
    
КонецПроцедуры
 
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗаданиеПриИзменении(Элемент)
	
	ЗаданиеПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаданиеПриИзмененииНаСервере()
	
    УстановитьИдентификаторЗаданияЗаписи();
    ЗаполнитьДанныеФормы();
	
КонецПроцедуры
 
&НаСервере
Процедура УстановитьИдентификаторЗаданияЗаписи()
	
    Запись.ИдентификаторЗадания = Запись.Задание.УникальныйИдентификатор();	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормы()
	
    ИдентификаторЗадания = Запись.ИдентификаторЗадания;
    ИдентификаторРезультата = Запись.ИдентификаторРезультата;
    ИдентификаторСообщенияОбОшибке = Запись.ИдентификаторСообщенияОбОшибке;
    
    Если ЗначениеЗаполнено(Запись.ИдентификаторРезультата) Тогда
      	ДанныеРезультата = ФайлыОбластейДанных.ДвоичныеДанныеФайла(Запись.ИдентификаторРезультата);
        Результат = ПолучитьСтрокуИзДвоичныхДанных(ДанныеРезультата);
    КонецЕсли; 
    Если ЗначениеЗаполнено(Запись.ИдентификаторСообщенияОбОшибке) Тогда
      	ДанныеСообщенияОбОшибке = ФайлыОбластейДанных.ДвоичныеДанныеФайла(Запись.ИдентификаторСообщенияОбОшибке);
        СообщениеОбОшибке = ПолучитьСтрокуИзДвоичныхДанных(ДанныеСообщенияОбОшибке);
    КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
